[
    {
        "id": 1,
        "name": "Modern React with Redux",
        "img": "https://www.tutorialswebsite.com/wp-content/uploads/react-redux.png",
        "category": "React",
        "shortdes": "Master React and Redux with React Router, Webpack, and Create-React-App. Includes Hooks!",
        "totalhour": "52 hours on-demand video",
        "access": "Full lifetime access",
        "certificate": "Certificate of completion",
        "ratings": 5,
        "duration": "6 Months",
        "Instructor": "MD.Abdur Rahman",
        "requirements": "Basic understanding of React and intermmdiate JavaScript",
        "you_learn": "Create dynamic web apps using the latest in web technology \\n Acquire the programming skills needed to obtain a software engineering job \\n Practice your skills with many large projects, exercises, and quizzes \\n Master the fundamentals concepts behind React and Redux \\n Become fluent in the toolchain supporting React, including NPM, Webpack, Babel, and ES6/ES2015 Javascript syntax \\n Be the engineer who explains how Redux works to everyone else, because you know the fundamentals so well \\n Realize the power of building reusable components",
        "details": "Congratulations!  You've found the most popular, most complete, and most up-to-date resource online for learning React and Redux! \\n housands of other engineers have learned React and Redux, and you can too.  This course uses a time-tested, battle-proven method to make sure you understand exactly how React and Redux work, and will get you a new job working as a software engineer or help you build that app you've always been dreaming about. \\n The difference between this course and all the others: you will understand the design patterns used by top companies to build massively popular web apps. \\n React is the most popular Javascript library of the last five years, and the job market is still hotter than ever.  Companies large and small can't hire engineers who understand React and Redux fast enough, and salaries for engineers are at an all time high.  It's a great time to learn React! \\n What will you build? \\n This course features hundreds of videos with dozens of custom diagrams to help you understand how React and Redux work.  No prior experience with either is necessary. Through tireless, patient explanations and many interesting practical examples, you'll learn the fundamentals of building dynamic and live web apps using React. \\n Each topic included in this course is added incrementally, to make sure that you have a solid foundation of knowledge.  You'll find plenty of discussion added in to help you understand exactly when and where to use each feature of React and Redux. \\n My guarantee to you: there is no other course online that teaches more features of React and Redux.  This is the most comprehensive resource there is. \\n Besides just React and Redux, you'll pick up countless other tidbits of knowledge, including ES2015 syntax, popular design patterns, even the clearest explanation of the keyword 'this' in Javascript that you'll ever hear. \\n This is the course I wanted to take when I first learned React: complete, up-to-date, and clear.",
        "for_whom": "Programmers looking to learn React \\n Developers who want to grow out of just using jQuery \\n Engineers who have researched React but have had trouble mastering some concepts"
    },
    {
        "id": 2,
        "name": "Node.js REST API with Express & MongoDB",
        "img": "https://assets.northflank.com/nodemongo_9c3caf6f45.png",
        "category": "Node.Js",
        "shortdes": "Build MVC Rest API with Node.js, Express & MongoDB. Secure REST API with JWT, document API with Swagger, Mongoose ODM",
        "totalhour": "60 hours on-demand video",
        "access": "Full lifetime access",
        "certificate": "Certificate of completion",
        "ratings": 4.5,
        "duration": "3 Months",
        "Instructor": "MD.Zakaria Zaman",
        "requirements": "Very basic understanding of Javascript",
        "you_learn": "REST API in Nodejs, Expressjs and MongoDB with MVC architecture.\\n Swagger documentation of your REST API on your API server itself.\\n MongoDB Mongoose schema and models.\\n MongoDB Mongoose schema and models.\\n Create, update, delete and find query using mongoose.\\n Secure REST API with JsonWebToken ( JWT )\\n REST API Design. \\n Create Re-usable services in REST API and CRUD API in Nodejs. \\n Create list pagination API using mongoose pagination query in Nodejs.",
        "details": "Want to learn how to build REST API with Nodejs, Express, and MongoDB ?? If yes, then this course is for you. In this course you will learn how to create MVC pattern REST API architecture in Nodejs, communication with MongoDB using Mongoose, Securing API with JWT ( JSON web token) and documenting API using popular open-source tool called swagger. \\n We are in the world of REST API architecture because of the boom in the micro-services. \\n company is moving toward REST API architecture from traditional monolithic server architecture. \\n What is REST API ? \\n A RESTful API is an application program interface (API) that uses HTTP requests to GET, PUT, POST and DELETE data. \\n Why MVC Pattern in REST API ? \\n MVC pattern/architecture allows you to decouple your code into various modules such as controller,services, models and routes so that you can scale your code without any burden of code maintenance as all the nodes in the MVC architecture works in sync and as expected.",
        "for_whom": "Javascript developer who want to build RESTful API with Nodejs, Expressjs & MongoDB. Secure REST API with JWT, document API with Swagger."
    },
    {
        "id": 3,
        "name": "Python Django Dev To Deployment",
        "img": "https://assets.website-files.com/5b6901669b93d7837e36dc4c/615e1104ffbf5ae592265cc7_python-django.png",
        "category": "Python Django",
        "shortdes": "Learn Python and build & deploy a real estate application using the Django framework & PostgreSQL",
        "totalhour": "11 hours on-demand video",
        "access": "3 Years access",
        "certificate": "Certificate of completion",
        "ratings": 4.8,
        "duration": "5 Months",
        "Instructor": "Jhankar Mahbub",
        "requirements": "Basic web development (HTML, Basic Programming fundamentals)",
        "you_learn": "Basic Python (lists, dictionaries, functions, conditionals, etc) \\n Setup Virtual Environments \\n Install & configure Django \\n Create Django apps \\n Postgres Setup (local and remote) \\n Schema planning, models & migration \\n Admin customization \\n User Authentication \\n Deploy to Digital Ocean with Gunicorn & Nginx",
        "details": "This is a very practical course where we take a list of requirements from a fictional company to build a real estate application using Django. We will take a basic html/css Bootstrap 4 theme and turn it into a real working application with an admin area to manage resources including property listings, realtors and contact inquiries. We also have a section on learning basic Python syntax",
        "for_whom": "Beginner Python developers that want to build a practical, real world project using the Django framework"
    },
    {
        "id": 4,
        "name": "The Complete Angular Course: Beginner to Advanced",
        "img": "https://www.mindinventory.com/blog/wp-content/uploads/2021/11/angular-13.png",
        "category": "Angular",
        "shortdes": "The most comprehensive Angular 4 (Angular 2+) course. Build a real e-commerce app with Angular, Firebase and Bootstrap 4",
        "totalhour": "30 hours on-demand video",
        "access": "5 Years access",
        "certificate": "Certificate of completion",
        "ratings": 4.9,
        "duration": "3 Months",
        "Instructor": "Abdullah Al Fahim",
        "requirements": "Basic familiarity with HTML, CSS and JavaScript",
        "you_learn": "Establish yourself as a skilled professional developer \\n Troubleshoot common Angular errors \\n Write clean and elegant code like a professional developer \\n Build real-world Angular applications on your own \\n Master the best practices",
        "details": "Angular is one of the most popular frameworks for building client apps with HTML, CSS and TypeScript. If you want to establish yourself as a front-end or a full-stack developer, you need to learn Angular. \\n If you've been confused or frustrated jumping from one Angular 4 tutorial to another, you've come to the right place. In this course, Mosh, author of several best-selling courses on Udemy, takes you on a fun and pragmatic journey to master Angular 4. \\n By the end of watching this course, you'll be able to: \\n Build real client apps with Angular on your own \\n Troubleshoot common compile-time and run-time errors \\n Write clean and maintainable code like a professional \\n Apply best practices when building Angular apps",
        "for_whom": "Developers who want to upgrade their skills and get better job opportunities \\n Front-end developers who want to stay up-to-date with the latest technology \\n Back-end developers who want to learn front-end development and become full-stack developers"
    },
    {
        "id": 5,
        "name": "React Native: Advanced Concepts",
        "img": "https://www.futuremind.com/m/articles/none/react_native_vs_native_apps_kJeZgPh.png",
        "category": "React Native",
        "shortdes": "Master the advanced topics of React Native: Animations, Maps, Notifications, Navigation and More!",
        "totalhour": "16.5 hours on-demand video",
        "access": "Life Time access",
        "certificate": "Certificate of completion",
        "ratings": 5,
        "duration": "2 Months",
        "Instructor": "Mir Hossain",
        "requirements": "Basic understanding of React Native",
        "you_learn": "Make compelling applications using expert-level features of React Native \\n Create amazingly smooth and performant animations \\n Build new React Native apps with Expo \\n Understand the latest Navigation options for new React Native apps \\n Add logic to your \\n Firebase backend with Google Cloud Functions \\n Update your users with cross platform Push Notifications \\n Handle your users going offline with Redux Persist",
        "details": "Go beyond the basics of React Native!  This course will teach you the advanced topics you need to make a #1 best-selling app. \\n Push Notifications? You will learn it.  In Depth Animations? Included.  Offline Data Persistence? Of course! \\n What Will You Build? \\n All of my courses are 'learn-by-doing': no boring endless lectures with Powerpoints, only live, interactive coding examples.  In this course we'll build three separate apps with increasing complexity, each of which will profile different features of React Native.  By putting each concept into a real app, you'll get a better idea of when to use each unique and powerful feature. \\n 1) Build a Tinder-like Swipe Deck. Yes, the classic animated component!  We'll make a big stack of beautiful cards that a user can slide around the screen, swiping right to 'like' an item, or 'left' to dislike an item.  This warmup will get you familiar with interpreting touch input through the PanResponder system, moving elements around with the Animated module, and turning extrapolating animation values through the Interpolation system. \\n 2) Dive into the backend with One Time Password authentication. Ever been prompted to sign in using a code that gets texted to you?  One Time Passwords are a new authentication flow that leverages a user's phone number as their unique identifying token.  We will use the Twilio API to send a text message to a user to verify their identity, while securing our business logic into Firebase's new Google Cloud Functions. \\n 3) Your own Job-Search app.  Tinder for jobs! This app is is 100% feature complete!  We'll build an app with a full welcome-screen tutorial for our new user's, Facebook authentication, and map components.  The user will be presented with a list of jobs to like or dislike based on their location by leveraging Indeed's Job API, then follow up and apply to their choice jobs. \\n Both OSX and Windows supported - develop iOS or Android!",
        "for_whom": "This course is for anyone looking to learn advanced topics of React Native"
    },
    {
        "id": 6,
        "name": "Flutter & Firebase: Build a Complete App for iOS & Android",
        "img": "https://repository-images.githubusercontent.com/257819405/4ed65000-84b0-11ea-9898-372a3d27a145",
        "category": "Flutter and Firebase",
        "shortdes": "Learn Dart, Flutter & Firebase by Google, and build a real-world, production ready app",
        "totalhour": "22 hours on-demand video",
        "access": "Life Time access",
        "certificate": "Certificate of completion",
        "ratings": 4.8,
        "duration": "2.5 Months",
        "Instructor": "Gias Uddin Hasan",
        "requirements": "Experience with another programming language is beneficial, but not strictly required",
        "you_learn": "Build a complete, real-world app with Flutter & Firebase \\n Write iOS & Android apps with a single codebase \\n Write production-ready code following best practices and become a competent Flutter developer \\n Fast-track your Flutter learning with practical tips and proven techniques",
        "details": "Flutter is a mobile framework by Google for building beautiful and fast native apps. Flutter is very productive and offers a rich set of widgets that makes building apps a breeze. Once you experience hot-reload and everything else Flutter has to offer, you will never want to go back. \\n In this course you will build a complete, real-world application for iOS and Android, by using Dart, Flutter and Firebase. \\n This course starts from the basics, and includes a full introduction to Dart and Flutter. This means that NO prior experience with Dart and mobile app development is needed. \\n As you make progress, the course will introduce more advanced topics, with special emphasis on writing production-ready code, so that you can learn how to build robust applications that scale. \\n And by learning Firebase as well, you will understand how to make modern reactive apps, and see why Flutter and Firebase are a great combination. \\n Important concepts are explained with clear diagrams. You will always learn what you will be building and why, and then how to do it. \\n This will give you a strong foundation, and the techniques you learn here will be valuable in your own Flutter apps. \\n So by the end of this course you will be a competent Flutter developer. \\n Course Structure \\n This is a complete course. With 21 hours of content, it will teach you everything you need to know about Flutter. \\n - Each lesson builds on top of the previous one (source code included). \\n - Each section covers a different topic. \\n You can follow the course from beginning to end, or choose the topics you’re most interested in. \\n Fast-track your learning \\n This course offers a lot of practical advice, along with tips and techniques that I have battle-tested over years of experience. \\n It goes far beyond 'making things work', and gives you a very solid understanding of many different techniques and their trade-offs. \\n And it will show you how to think about problems and their solutions, with the mindset of a top professional software engineer. \\n So taking this course will save you a lot of time and money, and will prepare you for building real-world apps. \\n And if you get stuck, you can ask questions and they will be quickly answered. \\n System requirements \\n Windows, macOS or Linux for Android app development \\n macOS for iOS app development",
        "for_whom": "Beginner or intermediate Dart and Flutter developers \\n Experienced iOS and Android developers \\n Developers who want to write apps on iOS and Android with a single codebase"
    }
]